---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SelectionBox
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SelectionBox

Isolates selected elements in the current view (if a 3D isometric view) or the default 3D view.